package study;

public class ThisChapContents {
	
	/*
	 * 이 책의 내용
	 * 
	 * 책의 주제
	 * =====================================
	 * 01.자료구조
	 * :자료(데이터)를 정리하는 방법.
	 *  List, Map, Tree, Queue, Stack 등
	 * 
	 * 02.알고리즘
	 * :문제 해결을 위해 알맞은 자료구조를 이용하여 데이터를 다루고
	 *  데이터를 처리하는 방법.
	 *  시간복잡도, 필요메모리 등
	 * 
	 * 03.정보검색
	 * :자료구조와 알고리즘을 이용한 간단한 웹 검색 엔진 만들기로 동기부여.
	 * 
	 * 
	 * 진행 순서
	 * =====================================
	 * 01.List인터페이스 구현 및 비교 (ArrayList, LinkedList)
	 * 02.Map인터페이스 구현 및 분석(HashTable,BinarySearchTree)
	 * 03.Tree구조
	 * 04.웹 검색 엔진 제작(Crawler, Indexer, Retriever)
	 * 
	 * =====================================
	 * *인터페이스: 메소드의 집합
	 * *
	 */

}
